aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
/***********************************************************************************************************************
* 免責事項
* このソフトウェアはルネサス エレクトロニクス株式会社によって提供され、ルネサス製品での使用のみを目的としています。
* 他の用途には使用できません。このソフトウェアはルネサス エレクトロニクス株式会社の所有物であり、
* 著作権法を含むすべての適用法によって保護されています。
* このソフトウェアは「現状のまま」提供されており、ルネサスはこのソフトウェアに関して、明示的、黙示的、
* または法定のいかなる保証も行いません。商品性、特定目的への適合性、および非侵害についての保証を含むが、
* これに限定されないすべての保証を明示的に否認します。法律で禁止されていない最大限の範囲で、
* ルネサス エレクトロニクス株式会社およびその関連会社は、このソフトウェアに関連するいかなる理由による
* 直接的、間接的、特別、偶発的、または結果的な損害についても責任を負いません。
* ルネサスは、通知なしにこのソフトウェアに変更を加える権利を留保し、このソフトウェアの提供を中止することがあります。
* このソフトウェアを使用することにより、以下のリンクにアクセスすることで見つかる追加の条件に同意したものとみなされます。
* http://www.renesas.com/disclaimer 
*
* 著作権 (C) 2015 ルネサス エレクトロニクス株式会社。無断複写・転載を禁じます。
***********************************************************************************************************************/
/***********************************************************************************************************************
* ファイル名    : r_can_rx.c
* 説明          : CAN FIT ドライバ。
************************************************************************************************************************
* 履歴 : 日付       バージョン 説明
*         : 08.04.2015 2.01    64M, 71M用。
*                              - NEWDATA、SENTDATA、MSGLOST、TRMABT、RECREQ、およびTRMREQビットに0を書き込む際、
*                              論理演算命令（AND）を使用せず、指定されたビットにのみ0を書き込み、
*                              他のビットには1を書き込んでから転送（MOV）命令を使用すること。
*                              RX64M/71M UM 43.2.8を参照。
*                              - R_CAN_TxCheck()およびR_CAN_TxStopMsg()を修正。注記
*                              "Bits SENTDATA and TRMREQ cannot be set to 0 simultaneously."を参照。RX64M/71M UM 43.2.8。
*         : 30.10.2015 2.02    - FIT用のコードパッケージの更新。
*                              - R_CAN_Create()：割り込みコールバックの引数を追加。
*                              - R_CAN_RxRead()を変更：IDEビットは混合モードでのみ有効。
*         : 09.06.2016 2.10    - 65Nを追加。
*                              - 混合IDモードのみで要求されたフレームタイプに応じてIDEビットを設定。
*                              - R_CAN_RxRead()を修正：混合モード：elseブロックが欠落。標準フレームIDがコピーされない。
*                              - R_CAN_Control()
*                                   o EXITSLEEP_CANMODEおよびENTERSLEEP_CANMODEケースで0ではなくch_nrを使用。
*                                   o OPERATE_CANMODEケース：Halt Statusビットが0であることも確認。
*         : 30.01.2017 2.11    - CAN_port_map_tにconstを追加し、インスタンス化にconstを追加する必要がなくなりました。
*                              - 65N 2MBでテスト実施。
*                              - 一部のGSCEコーディングガイドラインを実装。複数行変更。（プラグインを使用。）
*         : 14.08.2017 2.12    - CAN_ERS_ISR()関数を修正し、すべてのチャンネルの割り込みソースをチェック。
*         : 26.10.2018 2.13    - CAN2有効時にコンパイルエラーを引き起こすコメントフィールド"Function name:  CAN2_TXM2_ISR"を修正。
*         : 08.01.2019 2.15    - can_rx_callbackおよびcan_err_callbackのデフォルトコールバック割り当てを修正。
*         : 05.04.2019 3.00    - GCCおよびIARコンパイラのサポートを追加。
*         : 16.09.2019 3.11    - config_can_interrupts()関数、CAN0_TXM0_ISR()、CAN0_RXM0_ISR()、CAN1_TXM1_ISR()、CAN1_RXM1_ISR()、
*                                CAN2_TXM2_ISR()およびCAN2_RXM2_ISR()関数の上にCAN_USE_CAN0、CAN_USE_CAN1、CAN_USE_CAN2マクロを追加し、
*                                CAN0、CAN1またはCAN2を使用しない場合に割り込みベクタ番号が未定義になるのを防止。
*         : 30.12.2019 3.20    - API関数のコメントをDoxygenスタイルに変更。
*                              - アトミック制御のサポートを追加。
*                              - 第1世代デバイスのサポートを削除。
*                              - GSCEコーディングスタンダードRev.6.00に準拠するよう修正。
*         : 13.06.2020 4.00    - CAN FIFOのサポートを追加。
*                              - ピン設定に関連するソースコードを削除。
*                              - R_CAN_Control()のEXITSLEEP_CANMODEケースを修正。
*                              - R_CAN_RxSetMask()関数の処理を修正。
*         : 04.01.2021 4.10    - R_CAN_Create()でtxf_cb_funcがNULLの場合にcan_tx_callbackをcan_txf_callbackに変更。
*         : 01.04.2021 5.00    - 異なるチャンネルに異なるビットレートを設定するサポートを追加。
*         : 07.04.2021 5.10    - R_CAN_RxSetFIFOおよびR_CAN_RxSetFIFOXidのコメントを修正。
*                              - Doxygenコメントを更新。
*         : 08.09.2023 5.50    - GSCE Code Checker 6.50に従って更新。
*                              - WAIT_LOOPコメントを追加。
*         : 21.12.2023 5.60    - FIFOメールボックスモードでデータフレームとリモートフレームの両方を受信するサポートを追加。
*                              - FIFOメールボックスモードで拡張IDのリモートフレームを受信できない問題を修正。
***********************************************************************************************************************/
/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include <string.h>
#include "platform.h"
#include "r_can_rx_config.h"
#include "r_can_rx_if.h"

/******************************************************************************
Typedef definitions
******************************************************************************/
/******************************************************************************
Macro definitions
******************************************************************************/
/* これらのマクロは、いくつかのCANのwhileループがタイムアウトするかどうかを判断するためのものです。
タイムアウトした場合、canx_sw_err変数はゼロ以外の値になります。これは、CANペリフェラルとドライバのエラーがCPUを無期限にブロックするのを防ぐためです。 */
#define DEC_CHK_CAN_SW_TMR      (--can_tmo_cnt != 0)
#define MAX_CAN_SW_DELAY        (0x2000)

#define CHECK_MBX_NR            {if (mbox_nr > 31) return R_CAN_SW_BAD_MBX;}
#define CHECK_TXFIFO_MBX_NR     {if (mbox_nr > 27) return R_CAN_SW_BAD_MBX;}
#define CHECK_RXFIFO_MBX_NR     {if (((mbox_nr > 23) && (mbox_nr < 28)) || mbox_nr > 31 ) return R_CAN_SW_BAD_MBX;}
#define CHECK_MBX_MODE          {if (mb_mode > 1) return R_CAN_SW_BAD_MODE;}

/* 拡張IDモードビットフラグとして機能する長整数のMSBのマスクを定義します。 */
/* 拡張IDは下位29ビットを占有するため、これを使用して上位3ビットをマスクします。 */
#define XID_MASK                (0xE0000000)

/* 標準IDを構成する11ビットのマスクを定義します。 */
#define SID_MASK                (0x000007FF)

/* MAX_CHANNELS が CAN チャンネルの数と一致していることを確認してください */
#define MAX_CHANNELS (sizeof(CAN_CHANNELS)/sizeof(can_st_ptr))

/******************************************************************************
/******************************************************************************
グローバル変数およびインポートされた関数（externs）
******************************************************************************/
/******************************************************************************
定数定義
******************************************************************************/
/* ビットセット定義のためのメモリ領域 */
static const uint32_t  bit_set[32] = 
{
    MBX_0,  MBX_1,  MBX_2,  MBX_3, 
    MBX_4,  MBX_5,  MBX_6,  MBX_7,
    MBX_8,  MBX_9,  MBX_10, MBX_11, 
    MBX_12, MBX_13, MBX_14, MBX_15,
    MBX_16, MBX_17, MBX_18, MBX_19,
    MBX_20, MBX_21, MBX_22, MBX_23, 
    MBX_24, MBX_25, MBX_26, MBX_27,
    MBX_28, MBX_29, MBX_30, MBX_31, 
};

static const can_st_ptr CAN_CHANNELS[] =
{
    #ifdef CAN0
        &CAN0,
    #endif
    #ifdef CAN1
        &CAN1,
    #endif
    #ifdef CAN2
        &CAN2
    #endif
};

