aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
/******************************************************************************
グローバル変数およびファイルにプライベートな関数
******************************************************************************/
/* データ */
/* 関数 */
static uint32_t can_wait_tx_rx (const uint32_t ch_nr, const uint32_t mbox_nr);
static void     config_can_interrupts (const uint32_t ch_nr);
static void     universal_can_callback (void);
static void     can_module_stop_state_cancel (const uint32_t ch_nr);

/* CAN割り込み用のユーザ関数ベクトル。これらはR_CAN_Create()によって設定されます。 */
#ifdef CAN2     /* デバイス上に3つのCANチャネルが存在します。 */
    void (*can_tx_callback[MAX_CHANNELS])(void)     = {NULL, NULL, NULL};
    void (*can_txf_callback[MAX_CHANNELS])(void)    = {NULL, NULL, NULL};
    void (*can_rx_callback[MAX_CHANNELS])(void)     = {NULL, NULL, NULL};
    void (*can_rxf_callback[MAX_CHANNELS])(void)    = {NULL, NULL, NULL};
    void (*can_err_callback[MAX_CHANNELS])(void)    = {NULL, NULL, NULL};
#else
#ifdef CAN1     /* デバイス上に2つのCANチャネルが存在します。 */
    void (*can_tx_callback[MAX_CHANNELS])(void)     = {NULL, NULL};
    void (*can_txf_callback[MAX_CHANNELS])(void)    = {NULL, NULL};
    void (*can_rx_callback[MAX_CHANNELS])(void)     = {NULL, NULL};
    void (*can_rxf_callback[MAX_CHANNELS])(void)    = {NULL, NULL};
    void (*can_err_callback[MAX_CHANNELS])(void)    = {NULL, NULL};
#else           /* デバイス上に1つのCANチャネルのみ。 */
    void (*can_tx_callback[MAX_CHANNELS])(void)     = {NULL};
    void (*can_txf_callback[MAX_CHANNELS])(void)    = {NULL};
    void (*can_rx_callback[MAX_CHANNELS])(void)     = {NULL};
    void (*can_rxf_callback[MAX_CHANNELS])(void)    = {NULL};
    void (*can_err_callback[MAX_CHANNELS])(void)    = {NULL};
#endif
#endif

/******************************************************************************


                                C A N   A P I


******************************************************************************/
/***********************************************************************************************************************
* Function Name: R_CAN_Create
********************************************************************************************************************//**
* @brief CANペリフェラルを初期化します - ユーザー通信コールバック関数を設定し、CAN割り込みを構成し、異なるチャネルに異なるビットレートを設定し、
* メールボックスのデフォルトを設定し、CAN動作モードに入ります。\n
* この関数はCAN割り込みレベルとユーザーコールバックを設定します。この関数はR_CAN_SetBitrate()を呼び出し、デフォルトのマスクを設定します：フレームをマスクしません。
* @param[in] ch_nr - 使用するCANチャネル (MCU依存で0-2)。
* @param[in] mb_mode - 通常のメールボックス (0)、FIFO メールボックス (1)。
* @param[in] p_cfg - チャネル ch_nr のビットレートを構成する BRP、TSEG1、TSEG2、および SJW を含むデータ構造体へのアドレスです。
* @param[in] tx_cb_func - メールボックスの送信が完了したときにCANドライバによって呼び出されるアプリケーション内の関数の名前です。
* ポーリングモードを使用している場合、または何らかの理由で割り込みモードのコールバックを望まない場合は、NULLを指定します。
* @param[in] txf_cb_func - メールボックスが送信FIFOでの送信を完了するたび、または送信FIFOが送信完了により空になるたびにCANドライバによって呼び出されるアプリケーション内の関数の名前です。
* 割り込みモードのコールバックを望まない場合は、NULLを指定します。
* @param[in] rx_cb_func - メールボックスの受信が完了したときにCANドライバによって呼び出されるアプリケーション内の関数の名前です。
* ポーリングモードを使用している場合、または何らかの理由で割り込みモードのコールバックを望まない場合は、NULLを指定します。
* @param[in] rxf_cb_func - CANドライバによって、受信FIFO内のメールボックスが受信を完了したときや、受信FIFOが受信完了によってバッファ警告状態になったときに呼び出されるアプリケーション内の関数の名前です。
* 割り込みモードのコールバックを望まない場合は、NULLを指定します。
* @param[in] err_cb_func - CANドライバによってCANエラーが発生したときにアプリケーション内で呼び出される関数の名前です。
* ポーリングモードを使用している場合、または何らかの理由で割り込みモードのコールバックを望まない場合は、NULLを指定します。
* @retval R_CAN_OK                アクションが正常に完了しました。
* @retval R_CAN_SW_BAD_MBX        不正なメールボックス番号。
* @retval R_CAN_BAD_CH_NR         チャネル番号が存在しません。
* @retval R_CAN_BAD_MODE          モード番号が存在しません。
* @retval R_CAN_SW_RST_ERR        CANペリフェラルがリセットモードに入らなかった
* @retval R_CAN_MODULE_STOP_ERR   CANペリフェラル全体が停止状態（低電力）です。
* おそらくPRCRレジスタが使用されておらず、モジュール停止レジスタがロック解除されていない可能性があります。
* 他のR_CAN_Control()の戻り値も参照してください。
* @details この関数は、CANスリープモードからペリフェラルを起動し、CANリセットモードに設定します。次のデフォルト設定でメールボックスを構成します:\n
* メールボックスモードを設定: 通常のメールボックスモードまたはFIFOメールボックスモード。\n
* 新しいフレームが到着したときに未読のメールボックスデータを上書きします。\n
* デバイスをID優先（通常のCAN動作、オプションのメールボックス番号優先ではない）に設定します。\n
* すべてのメールボックスのマスクを無効に設定します。\n
* R_CAN_CreateはR_CAN_SetBitrate関数を呼び出し、r_can_rx_config.hでUSE_CAN_POLLがコメントアウトされている場合にCAN割り込みを構成します。\n
* 戻る前に、すべてのメールボックスをクリアし、ペリフェラルを動作モードに設定し、エラーをクリアします。
* @note ユーザーは、R_CAN_Create関数を呼び出す前に、p_cfg引数を通じてCANチャネルのビットレートを設定するためのボーレートプリスケーラ分周値とビットタイミング値を宣言する必要があります。
*/
uint32_t R_CAN_Create(const uint32_t ch_nr,
                    const uint32_t mb_mode,
                    const can_bitrate_config_t p_cfg,
                    void (*tx_cb_func)(void),
                    void (*txf_cb_func)(void),
                    void (*rx_cb_func)(void),
                    void (*rxf_cb_func)(void),
                    void (*err_cb_func)(void))
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status = R_CAN_OK;

    uint32_t i  = 0;

    uint32_t j  = 0;

    /* ハードウェアやファームウェアの不具合により、CANペリフェラルブロックがプログラムをwhileループでブロック（ハング）させる可能性があります。
    これを防ぐために、whileループ内のソフトウェアタイマーがタイムアウトし、CPUが続行できるようにします。 */
    uint32_t can_tmo_cnt = MAX_CAN_SW_DELAY;

    /* check mailbox mode */
    CHECK_MBX_MODE

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    if (NULL == tx_cb_func)
    {
        /* ポーリングモードの場合でも、安全対策として割り込みをデフォルト関数に設定します。 */
        can_tx_callback[ch_nr] = universal_can_callback;
    }
    else
    {
        /* CAN送信割り込みが発生したときに実行するユーザー関数を設定します。 */
        can_tx_callback[ch_nr] = tx_cb_func;
    }

    if (NULL == txf_cb_func)
    {
        /* ポーリングモードの場合でも、安全対策として割り込みをデフォルト関数に設定します。 */
        can_txf_callback[ch_nr] = universal_can_callback;
    }
    else
    {
        /* CAN送信割り込みが発生したときに実行するユーザー関数を設定します。 */
        can_txf_callback[ch_nr] = txf_cb_func;
    }

    if (NULL == rx_cb_func)
    {
        /* ポーリングモードの場合でも、安全対策として割り込みをデフォルト関数に設定します。 */
        can_rx_callback[ch_nr] = universal_can_callback;
    }
    else
    {
        /* CAN受信割り込みが発生したときに実行するユーザー関数を設定します。 */
        can_rx_callback[ch_nr] = rx_cb_func;
    }

    if (NULL == rxf_cb_func)
    {
        /* ポーリングモードの場合でも、安全対策として割り込みをデフォルト関数に設定します。 */
        can_rxf_callback[ch_nr] = universal_can_callback;
    }
    else
    {
        /* CAN受信割り込みが発生したときに実行するユーザー関数を設定します。 */
        can_rxf_callback[ch_nr] = rxf_cb_func;
    }

    if (NULL == err_cb_func)
    {
        /* Set the interrupt to a default function as a safety precaution. Even if in polled mode. */
        can_err_callback[ch_nr] = universal_can_callback;
    }
    else
    {
        /* Set what user function to execute when a CAN ERROR interrupt occurs. */
        can_err_callback[ch_nr] = err_cb_func;
    }

    can_module_stop_state_cancel(ch_nr); /* exit module stop state */

    if (SYSTEM.MSTPCRB.LONG & (1 << ch_nr)) /* Check bits 0, 1 or 2 for channel 0, 1 or 2 */
    {
        /* Module stop state bit did not clear. PRCR is probably locked. */
        return (R_CAN_MODULE_STOP_ERR);
    }

    /* Exit Sleep mode. This will also take us from HALT mode to OPERATE_CANMODE. */
    api_status |= R_CAN_Control(ch_nr, EXITSLEEP_CANMODE);

    /*** Set CAN Control register.***/

    /* BOM:    Bus Off recovery mode acc. to IEC11898-1 */
    can_block_p->CTLR.BIT.BOM = 0;

    if (FIFO_MAILBOX_MODE == mb_mode)    /* check normal or fifo mode */
    {
        /* MBM: Select FIFO mailbox mode. */
        can_block_p->CTLR.BIT.MBM = 1;
    }
    else
    {
        /* MBM: Select normal mailbox mode. */
        can_block_p->CTLR.BIT.MBM = 0;
    }

    /* IDFM: Select Frame ID mode. */
    can_block_p->CTLR.BIT.IDFM = FRAME_ID_MODE;

    /*  0 = Overwrite mode: Latest message overwrites old.
        1 = Overrun mode: Latest message discarded. */
    can_block_p->CTLR.BIT.MLM = 0;

    /* TPM: ID priority mode. */
    can_block_p->CTLR.BIT.TPM = 0;

