aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    /* TSRC: Only to be set to 1 in operation mode */
    can_block_p->CTLR.BIT.TSRC = 0;

    /* TSPS: Update every 8 bit times */
    can_block_p->CTLR.BIT.TSPS = 3;

    /* Set BAUDRATE */
    R_CAN_SetBitrate(ch_nr, p_cfg);

    /* Mask invalid for all mailboxes by default. */
    can_block_p->MKIVLR.LONG = 0xFFFFFFFF;

    /* Configure CAN interrupts. */
    config_can_interrupts(ch_nr);

    /* Reset -> HALT mode ************************************************************/
    api_status |= R_CAN_Control(ch_nr, HALT_CANMODE);

    /* Clear mailboxes in Halt mode. */
    /* WAIT_LOOP */
    for (i = 0; i < 32; i++)
    {
        can_block_p->MB[i].ID.LONG = 0x00;

        can_block_p->MB[i].DLC = 0x0000;

        /* WAIT_LOOP */
        for (j = 0; j < 8; j++)
        {
            can_block_p->MB[i].DATA[j] = 0x00;
        }

        /* WAIT_LOOP */
        for (j = 0; j < 2; j++)
        {
            can_block_p->MB[i].TS = 0x0000;
        }
    }

    /* Time Stamp Counter reset. Set the TSRC bit to 1 in CAN Operation mode. */
    can_block_p->CTLR.BIT.TSRC = 1;

    /* WAIT_LOOP */
    while ((can_block_p->CTLR.BIT.TSRC) && DEC_CHK_CAN_SW_TMR)
    {
        /* Wait loop. */
        R_BSP_NOP();
    }
    if (0 == can_tmo_cnt)
    {
        api_status |= R_CAN_SW_TSRC_ERR;
    }

    /* Check for errors so far, report, and clear. */
    if (can_block_p->STR.BIT.EST)
    {
        api_status |= R_CAN_SW_RST_ERR;
    }

    /* Clear Error Interrupt Factor Judge Register. */
    if (can_block_p->EIFR.BYTE)
    {
        api_status |= R_CAN_SW_RST_ERR;
    }
    can_block_p->EIFR.BYTE = 0x00;

    /* Clear Error Code Store Register. */
    if (can_block_p->ECSR.BYTE)
    {
        api_status |= R_CAN_SW_RST_ERR;
    }
    can_block_p->ECSR.BYTE = 0x00;

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_Create
 *****************************************************************************/ /* end R_CAN_Create() */

/***********************************************************************************************************************
* 関数名: R_CAN_PortSet
********************************************************************************************************************//**
* @brief MCUおよびトランシーバーポートピンを構成します。この関数は、MCUおよびトランシーバーポートピンの構成を担当します。
* トランシーバーポートピン（Enableなど）は設計によって異なるため、この関数を変更する必要があります。
* この関数は、Listen OnlyなどのCANポートテストモードに入るためにも使用されます。
* @param[in] ch_nr - 使用するCANチャネル (MCU依存で0-2)。
* @param[in] action_type \n
* ポートアクション:\n
*  ENABLE                      CANポートピンとCANトランシーバを有効にします。\n
*  DISABLE                     CANポートピンとCANトランシーバを無効にします。\n
*  CANPORT_TEST_LISTEN_ONLY    リッスンオンリーモードに設定します。ACKやエラーフレームは送信されません。\n
*  CANPORT_TEST_0_EXT_LOOPBACK 外部バスとループバックを使用します。初期デバッグに便利です。別のテストセクションを参照してください。\n
*  CANPORT_TEST_1_INT_LOOPBACK 内部のメールボックス通信のみを使用します。初期デバッグに便利です。別のテストセクションを参照してください。\n
*  CANPORT_RETURN_TO_NORMAL    通常のポート使用に戻します。\n
* @retval R_CAN_OK                アクションが正常に完了しました。
* @retval R_CAN_SW_BAD_MBX        不正なメールボックス番号。
* @retval R_CAN_BAD_CH_NR         チャネル番号が存在しません。
* @retval R_CAN_BAD_ACTION_TYPE   アクションタイプが存在しません。
* @retval R_CAN_SW_HALT_ERR       CANペリフェラルがハルトモードに入らなかった。
* @retval R_CAN_SW_RST_ERR        CANペリフェラルがリセットモードに入らなかった。\n
* 他のR_CAN_Control()の戻り値も参照してください。
* @details 内部ループバックモードを使用しない限り（初期テストおよびデバッグ用）、この関数はボードのデフォルトポート設定関数（例： 'hwsetup'）が使用された後に呼び出されることを確認してください。\n
* 他の（デフォルトの）ボード設定コードによって設定されたMCU CANポートピンの出力高/低がバスに悪影響を与える可能性があることに注意してください。
* ノードのハードリセットが他のノードをエラーモードにする原因となることがあります。
* その理由は、CANがポートを再構成する前に、すべてのポートがデフォルトの出力高/低に設定されていたためです。
* そのようなコードは削除する必要があります。さもなければ、短期間の間、ポートが出力低/高になり、CANバスの電圧レベルを乱す可能性があります。\n
* トランシーバーに応じて、トランシーバーポートピンを変更/追加する必要がある場合があります。\n
*/
uint32_t R_CAN_PortSet(const uint32_t ch_nr, const uint32_t action_type)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status = R_CAN_OK;

    if (ch_nr < MAX_CHANNELS) 
    { 
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else 
    {
        return (R_CAN_BAD_CH_NR);
    }

    switch (action_type)
    {
        case ENABLE:

            /* Port pin function select register setting */
            MPC.PWPR.BYTE = 0x00;    /* PWPR.PFSWE write protect off */
            MPC.PWPR.BYTE = 0x40;    /* PFS register write protect off */

            #if defined(CAN0) && defined(CAN0_TRX_STB_PORT) && defined(CAN0_TRX_STB_PIN)
            if (ch_nr == 0)
            {
                /* Configure CAN0 STBn pin. See config.h. */
                CAN_TRX_DDR(CAN0_TRX_STB_PORT, CAN0_TRX_STB_PIN) = 1;
                CAN_TRX_DR( CAN0_TRX_STB_PORT, CAN0_TRX_STB_PIN) = CAN0_TRX_STB_LVL;

                /* Configure CAN0 EN pin. */
                CAN_TRX_DDR(CAN0_TRX_ENABLE_PORT, CAN0_TRX_ENABLE_PIN) = 1;
                CAN_TRX_DR( CAN0_TRX_ENABLE_PORT, CAN0_TRX_ENABLE_PIN) = CAN0_TRX_ENABLE_LVL;
            }
            #endif
            #if defined(CAN1) && defined(CAN1_TRX_STB_PORT) && defined(CAN1_TRX_STB_PIN)
            if (ch_nr == 1)
            {
                /* Configure CAN1 STBn pin. See config.h. */
                CAN_TRX_DDR(CAN1_TRX_STB_PORT, CAN1_TRX_STB_PIN) = 1;
                CAN_TRX_DR( CAN1_TRX_STB_PORT, CAN1_TRX_STB_PIN) = CAN1_TRX_STB_LVL;

                /* Configure CAN1 EN pin. */
                CAN_TRX_DDR(CAN1_TRX_ENABLE_PORT, CAN1_TRX_ENABLE_PIN) = 1;
                CAN_TRX_DR( CAN1_TRX_ENABLE_PORT, CAN1_TRX_ENABLE_PIN) = CAN1_TRX_ENABLE_LVL;
            }
            #endif
            #if defined(CAN2) && defined(CAN2_TRX_STB_PORT) && defined(CAN2_TRX_STB_PIN)
            if (ch_nr == 2)
            {
                /* Configure CAN2 STBn pin. See config.h. */
                CAN_TRX_DDR(CAN2_TRX_STB_PORT, CAN2_TRX_STB_PIN) = 1;
                CAN_TRX_DR( CAN2_TRX_STB_PORT, CAN2_TRX_STB_PIN) = CAN2_TRX_STB_LVL;

                /* Configure CAN2 EN pin. */
                CAN_TRX_DDR(CAN2_TRX_ENABLE_PORT, CAN2_TRX_ENABLE_PIN) = 1;
                CAN_TRX_DR( CAN2_TRX_ENABLE_PORT, CAN2_TRX_ENABLE_PIN) = CAN2_TRX_ENABLE_LVL;
            }
            #endif

            MPC.PWPR.BYTE = 0x80;    /* PFS register write protect on */
            break;

        case DISABLE:

