aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    /* Set TrmReq bit to "1" */
    can_block_p->MCTL[mbox_nr].BIT.TX.TRMREQ = 1;
    }
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_Tx
 *****************************************************************************/ /* end R_CAN_Tx() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxCheck
********************************************************************************************************************//**
* @brief Check for successful data frame transmission. Use to check a mailbox for a successful data frame transmission.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to use (0-31).
* @retval R_CAN_OK            Transmission was completed successfully.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval R_CAN_MSGLOST       Message was overwritten or lost.
* @retval R_CAN_NO_SENTDATA   No message was sent.
* @details This function is only needed if an application needs to verify that a message has been transmitted for
* example so that it can progress a state machine, or if messages are sent back-to-back. With CAN’s level of transport
* control built into the silicon, it can reasonably be assumed that once a mailbox has been asked to send with the API
* that the message will indeed be sent. Safest if of course to use this function after a transmission.
*/
uint32_t R_CAN_TxCheck(const uint32_t ch_nr, const uint32_t mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status = R_CAN_OK;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Read and clear SentData flag. */
    if (0 == can_block_p->MCTL[mbox_nr].BIT.TX.SENTDATA)
    {
        api_status = R_CAN_NO_SENTDATA;
    }
    else
    {
        /* Clear SENTDATA.
         * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.
         * TRMREQ must be set to 0 (or will send again).
         * Do it twice since "Bits SENTDATA and TRMREQ cannot be set to 0 simultaneously." */
        can_block_p->MCTL[mbox_nr].BYTE = 0;
        can_block_p->MCTL[mbox_nr].BYTE = 0;
    }

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_TxCheck
 *****************************************************************************/ /* end R_CAN_TxCheck() */

/***********************************************************************************************************************
* Function Name: R_CAN_TxStopMsg
********************************************************************************************************************//**
* @brief Stop a mailbox that has been asked to transmit a frame
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to use (0-31).
* @retval R_CAN_OK            Action completed successfully.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_MODE      The mode number does not exist.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval R_CAN_SW_ABORT_ERR  Waiting for an abort timed out.
* @details This function clears the mailbox control or transmit FIFO control flags so that a transmission is stopped
* (TrmReq is set to 0 for normal mailboxes or TFE is set to 0 for transmit FIFO mailboxes). A software counter then
* waits for an abort for a maximum period of time.\n
* If the message was not stopped, R_CAN_SW_ABORT_ERR is returned. Note that the cause of this could be that the
* message was already sent.
*/
uint32_t R_CAN_TxStopMsg(const uint32_t ch_nr, const uint32_t  mb_mode, const uint32_t mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;
    
    uint32_t api_status     = R_CAN_OK;
    uint32_t can_tmo_cnt    = MAX_CAN_SW_DELAY;

    /* check mailbox mode */
    CHECK_MBX_MODE

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    if ((FIFO_MAILBOX_MODE == mb_mode)
            && (bit_set[mbox_nr] & 0x0f000000))   /* check fifo mailbox mode and using FIFO mailbox */
    {
        /* To abort FIFO transmission, it is necessary to clear the transmit FIFO enable bit (TFE) to 0 */
        can_block_p->TFCR.BIT.TFE = 0; /* Transmit FIFO enabled. */

        /* Wait for abort. */
        /* WAIT_LOOP */
        while ((!can_block_p->TFCR.BIT.TFEST) && DEC_CHK_CAN_SW_TMR)
        {
            /* Wait loop. */
            R_BSP_NOP();
        }
        if (0 == can_tmo_cnt)
        {
            api_status = R_CAN_SW_ABORT_ERR;
        }
        else
        {
            /* Do nothing */
            R_BSP_NOP();
        }
    }
    else
    {
        /* Clear message mailbox control register. Setting TRMREQ to 0 should abort.
         * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.
         * Do it twice since "Bits SENTDATA and TRMREQ cannot be set to 0 simultaneously." */
        can_block_p->MCTL[mbox_nr].BYTE = 0;
        can_block_p->MCTL[mbox_nr].BYTE = 0;

        /* Wait for abort. */
        /* WAIT_LOOP */
        while ((can_block_p->MCTL[mbox_nr].BIT.TX.TRMABT) && DEC_CHK_CAN_SW_TMR)
        {
            /* Wait loop. */
            R_BSP_NOP();
        }
        if (0 == can_tmo_cnt)
        {
            api_status = R_CAN_SW_ABORT_ERR;
        }

        /* Clear abort flag. Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. */
        can_block_p->MCTL[mbox_nr].BYTE = 0;
    }

