aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_TxStopMsg
 *****************************************************************************//* end R_CAN_TxStopMsg() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSet
********************************************************************************************************************//**
* @brief Set up a mailbox to receive.\n
* The API sets up a given mailbox to receive data frames with the given CAN 11-bit ID. Incoming data frames with the
* same ID will be stored in the mailbox.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to use (0-31).
* @param[in] id - The CAN ID which the mailbox should receive.
* @param[in] frame_type \n
*  DATA_FRAME      Send a normal data frame. \n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_SW_SET_TX_TMO     Waiting for previous transmission to finish timed out.
* @retval R_CAN_SW_SET_RX_TMO     Waiting for previous reception to complete timed out.
* @details The function will first wait for any previous transmission/reception to complete, then temporarily
* interrupt disable the mailbox. It sets the mailbox to the given standard ID value, and whether to receive normal
* CAN dataframes or remote frame requests.
*/
uint32_t R_CAN_RxSet(const uint32_t ch_nr,
                    const uint32_t  mbox_nr,
                    const uint32_t  id,
                    const uint32_t  frame_type)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status = R_CAN_OK;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Wait for any previous transmission/reception to complete. */
    api_status = can_wait_tx_rx(ch_nr, mbox_nr);

    /* Interrupt disable the mailbox. */
    can_block_p->MIER.LONG &= (~(bit_set[mbox_nr]));
    
    /* Clear message mailbox control register.
     * TRMREQ/RECREQ already 0 after can_wait_tx_rx(). (No need to write twice). */
    can_block_p->MCTL[mbox_nr].BYTE = 0;

    /*** Set Mailbox ID based on ID mode ***/
    /* Check for XID flag bit set in ID argument */
    if (id & XID_MASK)
    {
        /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
        can_block_p->MB[mbox_nr].ID.LONG = (id & (~XID_MASK));
    }
    else
    {
        /* Set message mailbox buffer Standard ID */ 
        can_block_p->MB[mbox_nr].ID.BIT.SID = (id & SID_MASK); /* Now put the lower 11 bit in the SID. */
    }

    /* Set IDE bit depending on if want to receive SID or XID frame. Only for mixed mode. */
    if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
    {
        if (id & XID_MASK)
        {
            can_block_p->MB[mbox_nr].ID.BIT.IDE = 1;
        }
        else
        {
            can_block_p->MB[mbox_nr].ID.BIT.IDE = 0;
        }
    }
    else
    {
        /* When not MIXED mode, IDE should be written with 0. */
        can_block_p->MB[mbox_nr].ID.BIT.IDE = 0;
    }

    /* Data frame = 0, Remote frame = 1    */
    if (REMOTE_FRAME == frame_type)
    {
        can_block_p->MB[mbox_nr].ID.BIT.RTR = 1;
    }
    else
    {
        can_block_p->MB[mbox_nr].ID.BIT.RTR = 0;
    }

    #if (USE_CAN_POLL == 0)
        /* Interrupt enable the mailbox */
        can_block_p->MIER.LONG |= (bit_set[mbox_nr]);
    #endif

    /* Request to receive the frame. (Set RecReq bit). */
    can_block_p->MCTL[mbox_nr].BYTE = 0x40;

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxSet
 *****************************************************************************/ /* end R_CAN_RxSet() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSetFIFO
********************************************************************************************************************//**
* @brief Set up a mailbox to receive.\n
* The API sets up a given FIFO mailbox to receive data frames with the given CAN 11-bit ID. Incoming data frames with
* the same ID will be stored in the mailbox.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to use (28-31).
* @param[in] fidcr0_value - The CAN ID which the mailbox should receive.
* @param[in] fidcr1_value - The CAN ID which the mailbox should receive.
* @param[in] fidcr0_frame_type \n
*  DATA_FRAME      receive a normal data frame. \n
*  REMOTE_FRAME    receive a remote data frame request.
* @param[in] fidcr1_frame_type \n
*  DATA_FRAME      receive a normal data frame. \n
*  REMOTE_FRAME    receive a remote data frame request.
* @param[in] mkr6_value - The mask register.
* @param[in] mkr7_value - The mask register.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_MODE          The mode number does not exist.
* @retval CAN_ERR_NOT_FIFO_MODE   Current mailbox mode is not FIFO mailbox mode.
* @details The function will first temporarily interrupt disable the mailbox. Then it sets whether to receive normal
* CAN data frames or remote frame requests. It also sets the FIFO mailbox to the given ID value. Next, it performs
* setting value for mask register, refer to section R_CAN_RxSetMask in the application note for details.
*/
uint32_t R_CAN_RxSetFIFO(const uint32_t  ch_nr,
                        const uint32_t  mb_mode,
                        const uint32_t  mbox_nr,
                        const uint32_t  fidcr0_value,
                        const uint32_t  fidcr1_value,
                        const uint32_t  fidcr0_frame_type,
                        const uint32_t  fidcr1_frame_type,
                        const uint32_t  mkr6_value,
                        const uint32_t  mkr7_value)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

