aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    uint32_t api_status = R_CAN_OK;

    /* check mailbox mode */
    CHECK_MBX_MODE

    /* return if not FIFO_MAILBOX_MODE */
    if (FIFO_MAILBOX_MODE != mb_mode)    /* check normal or fifo mode */
    {
        return (CAN_ERR_NOT_FIFO_MODE);
    }

    /* return if mailbox is not receive fifo mailbox(28 -->31) */
    if ((mbox_nr < 28) || (mbox_nr > 31))
    {
        return (R_CAN_SW_BAD_MBX);
    }

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Shift to CAN Halt mode only when the CAN operation mode is not Halt or Reset */
    if ((CAN_RESET != can_block_p->CTLR.BIT.CANM) && (CAN_HALT != can_block_p->CTLR.BIT.CANM))
    {
        /* Write to fidcr0, fidcr1 and mkr6, mkr7 in CAN reset mode or CAN halt mode. */
        R_CAN_Control(ch_nr, HALT_CANMODE);
    }

    /* In FIFO mailbox mode, change the bits in MIER for the related FIFO only
     * when the RFE bit in RFCR is 0 and the RFEST flag in RFCR is 1 */
    if ((0 == can_block_p->RFCR.BIT.RFE) && (1 == can_block_p->RFCR.BIT.RFEST))
    {
        /* Interrupt disable the mailbox. */
        can_block_p->MIER.LONG &= (~(bit_set[28]));
    }

    /*** Set Mailbox ID based on ID mode ***/
    /* Check for XID flag bit set in fidcr0_value argument */
    if (fidcr0_value & XID_MASK)
    {
        /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
        can_block_p->FIDCR0.LONG = (fidcr0_value & (~XID_MASK));
    }
    else
    {
        /* Set message mailbox buffer Standard ID */
        can_block_p->FIDCR0.BIT.SID = (fidcr0_value & SID_MASK);
    }

    /* Set IDE bit depending on if want to receive SID or XID frame. Only for mixed mode. */
    if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
    {
        if (fidcr0_value & XID_MASK)
        {
        /* Mixed mode; select to send extended frame. */
        can_block_p->FIDCR0.BIT.IDE = 1;
        }
        else
        {
        /* Always set IDE to 0 (unless mixed mode and extended frame as above). */
        can_block_p->FIDCR0.BIT.IDE = 0;
        }
    }
    else
    {
        /* When not MIXED mode, IDE should be written with 0. */
        can_block_p->FIDCR0.BIT.IDE = 0;
    }

    /* Check for XID flag bit set in fidcr1_value argument */
    if (fidcr1_value & XID_MASK)
    {
        /* Set message mailbox buffer Extended ID, masking off temporary XID flag bit. */
        can_block_p->FIDCR1.LONG = (fidcr1_value & (~XID_MASK));
    }
    else
    {
        /* Set message mailbox buffer Standard ID */
        can_block_p->FIDCR1.BIT.SID = (fidcr1_value & SID_MASK);
    }

    /* FIDCR0 frame type
     * Data frame = 0, Remote frame = 1 */
    if (REMOTE_FRAME == fidcr0_frame_type)
    {
        can_block_p->FIDCR0.BIT.RTR = 1;
    }
    else
    {
        can_block_p->FIDCR0.BIT.RTR = 0;
    }

    /* FIDCR1 frame type
     * Data frame = 0, Remote frame = 1 */
    if (REMOTE_FRAME == fidcr1_frame_type)
    {
        can_block_p->FIDCR1.BIT.RTR = 1;
    }
    else
    {
        can_block_p->FIDCR1.BIT.RTR = 0;
    }

    /* Set IDE bit depending on if want to receive SID or XID frame. Only for mixed mode. */
    if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
    {
        if (fidcr1_value & XID_MASK)
        {
        /* Mixed mode; select to send extended frame. */
        can_block_p->FIDCR1.BIT.IDE = 1;
        }
        else
        {
        /* Always set IDE to 0 (unless mixed mode and extended frame as above). */
        can_block_p->FIDCR1.BIT.IDE = 0;
        }
    }
    else
    {
        /* When not MIXED mode, IDE should be written with 0. */
        can_block_p->FIDCR1.BIT.IDE = 0;
    }

    if ((EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM) || (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM))
    {
        /* Set XID 29-bit mask value in mask register. */
        can_block_p->MKR[6].LONG = (mkr6_value & (~XID_MASK)); /* Set XID 29-bit mask value in mask register 6. */
        can_block_p->MKR[7].LONG = (mkr7_value & (~XID_MASK)); /* Set XID 29-bit mask value in mask register 7. */
    }
    else
    {
        /* Set SID 11-bit mask value in mask register. */
        can_block_p->MKR[6].BIT.SID = mkr6_value; /* Set SID 11-bit mask value in mask register 6. */
        can_block_p->MKR[7].BIT.SID = mkr7_value; /* Set SID 11-bit mask value in mask register 7. */
    }

    /* Set mailbox mask to be used. (0 = mask VALID.).
     *  Set bits 31 to 24 to 0 in FIFO mailbox mode */
    can_block_p->MKIVLR.LONG &= (~(0xFF000000));

    #if (USE_CAN_POLL == 0)
    /* In FIFO mailbox mode, change the bits in MIER for the related FIFO only
     * when the RFE bit in RFCR is 0 and the RFEST flag in RFCR is 1 */
        if ((0 == can_block_p->RFCR.BIT.RFE) && (1 == can_block_p->RFCR.BIT.RFEST))
        {
            /* Interrupt enable the mailbox */
            can_block_p->MIER.LONG |= (bit_set[28]);

            /* Generate interrupt when Receive FIFO warning */
            if (CAN_CFG_RXFIFO_INT_GEN_TIMING == 1)
            {
                can_block_p->MIER.LONG |= (bit_set[29]);
            }
        }
    #endif

    /* Receive FIFO enable */
    can_block_p->RFCR.BIT.RFE = 1;

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxSetFIFO
 *****************************************************************************/ /* end R_CAN_RxSetFIFO() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSetXid
********************************************************************************************************************//**
* @brief Set up a mailbox to receive.\n
* The API sets up a given mailbox to receive data frames with the given CAN 11-bit ID. Incoming data frames with the
* same ID will be stored in the mailbox, except the ID will be a 29-bit ID.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to use (0-31).
* @param[in] xid - The CAN ID which the mailbox should receive.
* @param[in] frame_type \n
*  DATA_FRAME      Send a normal data frame. \n
*  REMOTE_FRAME    Send a remote data frame request.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_SW_SET_TX_TMO     Waiting for previous transmission to finish timed out.
* @retval R_CAN_SW_SET_RX_TMO     Waiting for previous reception to complete timed out.
* @details The function will first wait for any previous transmission/reception to complete, then temporarily
* interrupt disable the mailbox. It sets the mailbox to the given standard ID value, and whether to receive normal
* CAN dataframes or remote frame requests.
*/
uint32_t R_CAN_RxSetXid(const uint32_t     ch_nr, 
                        const uint32_t     mbox_nr,
                        uint32_t           xid,
                        const uint32_t     frame_type)
{
    /* Add the Xid bit so that 29-bit ID will be used by R_CAN_RxSet(). */
    return (R_CAN_RxSet(ch_nr, mbox_nr, (xid | XID_MASK) , frame_type));
}
/******************************************************************************
 End of function R_CAN_RxSetXid
 *****************************************************************************/ /* end R_CAN_RxSetXid() */

