aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
/***********************************************************************************************************************
* Function Name: R_CAN_RxSetFIFOXid
********************************************************************************************************************//**
 * @brief Set up a mailbox to receive.\n
* The API sets up a given FIFO mailbox to receive data frames with the given CAN 29-bit ID. Incoming data frames with
* the same ID will be stored in the mailbox.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to use (28-31).
* @param[in] xfidcr0_value - The CAN ID which the mailbox should receive.
* @param[in] xfidcr1_value - The CAN ID which the mailbox should receive.
* @param[in] fidcr0_frame_type \n
*  DATA_FRAME      receive a normal data frame. \n
*  REMOTE_FRAME    receive a remote data frame request.
* @param[in] fidcr1_frame_type \n
*  DATA_FRAME      receive a normal data frame. \n
*  REMOTE_FRAME    receive a remote data frame request.
* @param[in] mkr6_value - The mask register.
* @param[in] mkr7_value - The mask register.
* @retval R_CAN_OK                Action completed successfully.
* @retval R_CAN_SW_BAD_MBX        Bad mailbox number.
* @retval R_CAN_BAD_CH_NR         The channel number does not exist.
* @retval R_CAN_BAD_MODE          The mode number does not exist.
* @retval CAN_ERR_NOT_FIFO_MODE   Current mailbox mode is not FIFO mailbox mode.
* @details The function will first temporarily interrupt disable the mailbox. Then it sets whether to receive normal
* CAN data frames or remote frame requests. It also sets the FIFO mailbox to the given ID value. Next, it performs
* setting value for mask register, refer to section R_CAN_RxSetMask in the application note for details.
*/
uint32_t R_CAN_RxSetFIFOXid(const uint32_t     ch_nr,
                            const uint32_t     mb_mode,
                            const uint32_t     mbox_nr,
                            uint32_t           xfidcr0_value,
                            uint32_t           xfidcr1_value,
                            const uint32_t     fidcr0_frame_type,
                            const uint32_t     fidcr1_frame_type,
                            const uint32_t     mkr6_value,
                            const uint32_t     mkr7_value)
{
    /* Add the Xid bit so that 29-bit ID will be used by R_CAN_RxSetFIFO(). */
    return (R_CAN_RxSetFIFO(ch_nr, mb_mode, mbox_nr, (xfidcr0_value | XID_MASK),
                            (xfidcr1_value | XID_MASK), fidcr0_frame_type, fidcr1_frame_type, mkr6_value, mkr7_value));
}
/******************************************************************************
 End of function R_CAN_RxSetFIFOXid
 *****************************************************************************/ /* end R_CAN_RxSetXid() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxPoll
********************************************************************************************************************//**
* @brief Checks if a mailbox has received a message
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which CAN mailbox to check (0-31).
* @retval R_CAN_OK            There is a message waiting.
* @retval R_CAN_NOT_OK        No message waiting.
* @retval R_CAN_RXPOLL_TMO    Message pending but timed out.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @details When a mailbox is set up to receive certain messages, it is important to determine when it has finished
* receiving successfully. There are two methods for doing this: \n
* Polling. Call the API regularly to check for new messages. USE_CAN_POLL must be defined in the CAN configuration
* file. If there is a message use R_CAN_RxRead to fetch it. \n
* Using the CAN receive interrupt (USE_CAN_POLL not defined): Use this API to check which mailbox received. Then
* notify the application. \n
* The function returns R_CAN_OK if new data was found in the mailbox.
*
*/
uint32_t R_CAN_RxPoll(const uint32_t  ch_nr, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status = R_CAN_NOT_OK;
    uint32_t poll_delay = MAX_CANREG_POLLCYCLES;

    CHECK_MBX_NR
    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Wait if new data is currently being received. */
    /* WAIT_LOOP */
    while ((can_block_p->MCTL[mbox_nr].BIT.RX.INVALDATA) && poll_delay)
    {
        poll_delay--;
    }

    if (0 == poll_delay)    /* Still updating mailbox. Come back later. */
    {
        api_status = R_CAN_RXPOLL_TMO;
    }
    else /* Message received? */
    {
        /* If message received, tell user. */
        if (1 == can_block_p->MCTL[mbox_nr].BIT.RX.NEWDATA)
        {
            api_status = R_CAN_OK;
        }
    }
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxPoll
 *****************************************************************************//* end R_CAN_RxPoll() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxRead
********************************************************************************************************************//**
* @brief Read the CAN data frame content from a mailbox. The API checks if a given mailbox has received a message.
* If so, a copy of the mailbox’s dataframe will be written to the given structure.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] mb_mode - Normal mailbox (0), FIFO mailbox (1).
* @param[in] mbox_nr - Which CAN mailbox to check (0-31).
* @param[in] frame_p - Refers to a pointer to a data frame structure in memory. It is an address to the data structure
*                       into which the function will place a copy of the mailbox’s received CAN data frame.
* @retval R_CAN_OK            There is a message waiting.
* @retval R_CAN_BAD_MODE      The mode number does not exist.
* @retval R_CAN_SW_BAD_MBX    Bad mailbox number.
* @retval R_CAN_BAD_CH_NR     The channel number does not exist.
* @retval CAN_ERR_BOX_EMPTY   No unread message in receive FIFO.
* @retval R_CAN_MSGLOST       Message was overwritten or lost.
* @details This function is used to receive the message by the normal mailboxes or receive FIFO mailboxes.\n
To receive FIFO mailboxes, it checks Receive FIFO Empty Status Flag to ensure unread message in receive FIFO.
If have, it loads the ID value, the Data Length Code and the data frame payload bytes (0-7) of message into the mailbox.
Finally, it checks Message Lost then write FF to Receive FIFO Pointer Control Register.\n
To normal mailboxes, Use R_CAN_RxPoll() first to check whether the mailbox has received a message.\n
This function is used to fetch the message from a mailbox, either when using polled mode or from a CAN receive
interrupt.
*/
uint32_t R_CAN_RxRead(const uint32_t    ch_nr,
                    const uint32_t     mb_mode,
                    const uint32_t     mbox_nr,
                    can_frame_t* const frame_p)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

