aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    uint32_t i = 0;

    uint32_t api_status = R_CAN_OK;

    /* check mailbox mode*/
    CHECK_MBX_MODE

    /* check mailbox for fifo mailbox mode:
     * Normal mailbox: 0 --> 23,
     * Receive fifo mailbox: 28 --> 31;
     * return if number of mailbox is transmit fifo mailbox(24 -->27) or other mailbox */
    if (FIFO_MAILBOX_MODE == mb_mode)    /* check normal or fifo mailbox mode */
    {
        /* return if MBX is receive FIFO mailbox */
        CHECK_RXFIFO_MBX_NR
    }
    else
    {
    CHECK_MBX_NR
    }

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    if ((FIFO_MAILBOX_MODE == mb_mode) && (bit_set[mbox_nr] & 0xf0000000))    /* check normal or fifo mode */
    {
        /* return if FIFO is empty */
        if (can_block_p->RFCR.BIT.RFEST)
        {
            return (CAN_ERR_BOX_EMPTY);
        }

        /* EXT_ID_MODE */
        /* Copy received data from message mailbox to memory. The IDE bit is only valid in mixed mode. */
        if (EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            /* Get mailbox Extended ID, keeping only lower 29 bits. */
            frame_p->id = (can_block_p->MB[28].ID.LONG & (~XID_MASK));
        }
        /* MIXED_ID_MODE */
        else if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            if (1 == can_block_p->MB[28].ID.BIT.IDE) /* Check for XID control bit set. */
            {
                /* Get mailbox Extended ID, keeping only lower 29 bits. */
                frame_p->id = (can_block_p->MB[28].ID.LONG & (~XID_MASK));
            }
            else
            {
                /* Get only the lower 11 bits from the SID. */
                frame_p->id = can_block_p->MB[28].ID.BIT.SID;
            }
        }
        /* STD_ID_MODE */
        else
        {
            /* Get lower 11 bits from SID. */
            frame_p->id = can_block_p->MB[28].ID.BIT.SID;
        }

        /* Casting the register into uint8_t */
        frame_p->dlc = (uint8_t)can_block_p->MB[28].DLC;

        /* WAIT_LOOP */
        for (i = 0; i < can_block_p->MB[mbox_nr].DLC; i++)
        {
            frame_p->data[i] = can_block_p->MB[28].DATA[i];
        }

        /* check receive FIFO message lost */
        if (can_block_p->RFCR.BIT.RFMLF)
        {
            /* Clear receive FIFO message lost flag to 0 */
            can_block_p->RFCR.BYTE = 0x01;

            api_status = R_CAN_MSGLOST;
        }

        /* Write FFh to receive FIFO pointer control register */
        can_block_p->RFPCR = 0xFF;
    }

    /* Content of below else will occur in 2 case:
     * 1: Read message by MBX normal in FIFO mailbox mode when FIFO_MAILBOX_MODE == mb_mode
       2: Read message by MBX normal in normal mailbox mode when FIFO_MAILBOX_MODE != mb_mode */
    else
    {
        /* EXT_ID_MODE */
        /* Copy received data from message mailbox to memory. The IDE bit is only valid in mixed mode. */
        if (EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            /* Get mailbox Extended ID, keeping only lower 29 bits. */
            frame_p->id = (can_block_p->MB[mbox_nr].ID.LONG & (~XID_MASK));
        }
        /* MIXED_ID_MODE */
        else if (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM)
        {
            if (1 == can_block_p->MB[mbox_nr].ID.BIT.IDE) /* Check for XID control bit set. */
            {
                /* Get mailbox Extended ID, keeping only lower 29 bits. */
                frame_p->id = (can_block_p->MB[mbox_nr].ID.LONG & (~XID_MASK));
            }
            else
            {
                /* Get only the lower 11 bits from the SID. */
                frame_p->id = can_block_p->MB[mbox_nr].ID.BIT.SID;
            }
        }
        /* STD_ID_MODE */
        else
        {
            /* Get lower 11 bits from SID. */
            frame_p->id = can_block_p->MB[mbox_nr].ID.BIT.SID;
        }

        /* Casting the register into uint8_t */
        frame_p->dlc = (uint8_t)can_block_p->MB[mbox_nr].DLC;

        /* WAIT_LOOP */
        for (i = 0; i < can_block_p->MB[mbox_nr].DLC; i++)
        {
            frame_p->data[i] = can_block_p->MB[mbox_nr].DATA[i];
        }

        /* Check if message was lost/overwritten. */
        if (can_block_p->MCTL[mbox_nr].BIT.RX.MSGLOST)
        {
            api_status = R_CAN_MSGLOST;
        }

        /* Clear MSGLOST.
         * Also set NEWDATA to 0 since the mailbox was just emptied and start over with new RxPolls.
         * Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. See RX64M/71M UM 43.2.8.*/
        can_block_p->MCTL[mbox_nr].BYTE = 0x40;
    }

    return (api_status);
}
/******************************************************************************
 End of function R_CAN_RxRead
 *****************************************************************************//* end R_CAN_RxRead() */

/***********************************************************************************************************************
* Function Name: R_CAN_RxSetMask
********************************************************************************************************************//**
* @brief Sets the CAN ID Acceptance Masks. To accept only one ID, set mask to all ones. To accept all messages, set
* mask to all zeros. To accept a range of messages, set the corresponding ID bits to zero.
* @param[in] ch_nr -  CAN channel to use (0-2 MCU dependent).
* @param[in] mbox_nr - Which mailbox to mask (0-31). Four mailboxes will be affected within its group.
* @param[in] mask_value - Mask value. (0-0x7FF)
* @details Receive mailboxes can use a mask to filter out one message or expand receiving to a range of messages
* (CAN IDs). The mask enables this using the mailbox group’s ID field. There is one mask for mailbox 0-3, one
* for 4-7, etc. Changing a mask will therefore affect the behavior of adjacent mailboxes. \n
*  Each '0' in the mask means "mask this bit", or "don't look at that bit"; accept anything.\n
*  Each '1' means check if the CAN-ID bit in this position matches the CAN-ID of the mailbox.\n
*  See section R_CAN_RxSetMask in the application note for details.
*/
void R_CAN_RxSetMask(const uint32_t  ch_nr,
                    const uint32_t  mbox_nr,
                    const uint32_t  mask_value)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return;
    }

