aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    /* Shift to CAN Halt mode only when the CAN operation mode is not Halt or Reset */
    if ((CAN_RESET != can_block_p->CTLR.BIT.CANM) && (CAN_HALT != can_block_p->CTLR.BIT.CANM))
    {
        /* Write to MKR0 to MKR7 in CAN reset mode or CAN halt mode.*/
        R_CAN_Control(ch_nr, HALT_CANMODE);
    }

    /* Set mask for the group of mailboxes. */
    if ((EXT_ID_MODE == can_block_p->CTLR.BIT.IDFM) || (MIXED_ID_MODE == can_block_p->CTLR.BIT.IDFM))
    {
        /* Set XID 29-bit mask value in mask register. */
        can_block_p->MKR[mbox_nr/4].LONG = (mask_value & (~XID_MASK));
    }
    else
    {
        /* Set SID 11-bit mask value in mask register. */
        can_block_p->MKR[mbox_nr/4].BIT.SID = mask_value;
    }

    /* Set mailbox mask to be used. (0 = mask VALID.) */
    can_block_p->MKIVLR.LONG &= (~(bit_set[mbox_nr]));

}
/******************************************************************************
 End of function R_CAN_RxSetMask
 *****************************************************************************//* end R_CAN_RxSetMask() */

/*****************************************************************************
Function name:  can_wait_tx_rx
Arguments:      Channel nr.
                Mailbox nr.
Description:    Wait for communicating mailbox to complete action. This would 
                be apporopriate for example if a mailbox all of a sudden needs 
                to be reconfigured but the user wants any pending receive or 
                transmit to finish.
Return value:   R_CAN_OK            There is a message waiting.
                R_CAN_SW_BAD_MBX    Bad mailbox number.
                R_CAN_BAD_CH_NR     The channel number does not exist.
                R_CAN_SW_SET_TX_TMO Waiting for previous transmission to finish 
                                    timed out.
                R_CAN_SW_SET_RX_TMO Waiting for previous reception to complete 
                                    timed out.
*****************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(can_wait_tx_rx)
uint32_t can_wait_tx_rx(const uint32_t  ch_nr, const uint32_t  mbox_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status     = R_CAN_OK;
    uint32_t can_tmo_cnt    = MAX_CAN_SW_DELAY;

    /* Mailbox and channel nr already checked by caller. */
    can_block_p = CAN_CHANNELS[ch_nr];

    /* Wait for any previous transmission to complete. */
    if (can_block_p->MCTL[mbox_nr].BIT.TX.TRMREQ)
    {
        /* WAIT_LOOP */
        while ((0 == can_block_p->MCTL[mbox_nr].BIT.TX.SENTDATA) && DEC_CHK_CAN_SW_TMR)
        {
            /* Wait loop. */
            R_BSP_NOP();
        }
        if (0 == can_tmo_cnt)
        {
            api_status = R_CAN_SW_SET_TX_TMO;
        }
    }
    /* Wait for any previous reception to complete. */
    else if (can_block_p->MCTL[mbox_nr].BIT.RX.RECREQ)
    {
        /* WAIT_LOOP */
        while ((1 == can_block_p->MCTL[mbox_nr].BIT.RX.INVALDATA) && DEC_CHK_CAN_SW_TMR)
        {
            /* Wait loop. */
            R_BSP_NOP();
        }
        if (0 == can_tmo_cnt)
        {
            api_status = R_CAN_SW_SET_RX_TMO;
        }
    }
    else
    {
        /* Do nothing */
        R_BSP_NOP();

    }
    return (api_status);
}
/******************************************************************************
 End of function can_wait_tx_rx
 *****************************************************************************/
/* end can_wait_tx_rx() */

/***********************************************************************************************************************
* Function Name: R_CAN_CheckErr
********************************************************************************************************************//**
* @brief Check for bus errors. The API checks the CAN status, or Error State, of the CAN peripheral.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @retval R_CAN_BAD_CH_NR               The channel number does not exist.
* @retval R_CAN_STATE_ERROR_ACTIVE      CAN bus status is normal.
* @retval R_CAN_STATE_ERROR_PASSIVE     Node has sent at least 127 Error frames for either the Transmit Error Counter,
*                                       or the Receive Error Counter.
* @retval R_CAN_STATE_BUSOFF            Node’s Transmit Error Counter has surpassed 255 due to the node’s failure to
*                                       transmit correctly.
* @details The API checks the CAN status flags of the CAN peripheral and returns the status error code. It tells
* whether the node is in a functioning state or not and is used for application error handling.\n
* It should be polled either routinely from the main loop, or via the CAN error interrupt. Since the peripheral
* automatically handles retransmissions and Error frames it is usually of no advantage to include an error interrupt
* routine. \n
* If an error state is encountered the application can just wait and monitor for the peripheral to recover, as the
* CAN peripheral takes itself on or off line depending on its state. After a recovery is discovered, the application
* should restart.\n
* See section R_CAN_CheckErr in the application note for details.
*/
uint32_t R_CAN_CheckErr(const uint32_t ch_nr)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    uint32_t api_status = R_CAN_STATUS_ERROR_ACTIVE;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return (R_CAN_BAD_CH_NR);
    }

    /* Check CAN error state */
    if (can_block_p->STR.BIT.EST)
    {
        /* Check error-passive state */
        if (can_block_p->STR.BIT.EPST)
        {
            api_status = R_CAN_STATUS_ERROR_PASSIVE;
        }
        /* Check if bus off state */
        else if (can_block_p->STR.BIT.BOST)
        {
            api_status = R_CAN_STATUS_BUSOFF;
        }
        else
        {
            /* Keep api_status as R_CAN_STATUS_ERROR_ACTIVE */
            R_BSP_NOP();
        }
    }
    
