aman-singh6/EX01_RX72N/src/smc_gen/r_can_rx/src/r_can_rx.c
    return (api_status);
}
/******************************************************************************
 End of function R_CAN_CheckErr
 *****************************************************************************//* end R_CAN_CheckErr() */

/***********************************************************************************************************************
* Function Name: R_CAN_SetBitrate
********************************************************************************************************************//**
* @brief Set the CAN bitrate (communication speed). The baud rate and bit timing must always be set during the
* configuration process. It can be changed later if reset mode is entered.
* @param[in] ch_nr - CAN channel to use (0-2 MCU dependent).
* @param[in] p_cfg - It is an address to the data structure containing the BRP, TSEG1, TSEG2, and SJW that constitute
* the bitrate for channel ch_nr.
* @details Setting the baud rate or data speed on the CAN bus requires some understanding of CAN bit timing and MCU
* frequency, as well as reading hardware manual figures and tables.\n
* Some calculations need to be done to set up the baud rate: Selects the baud rate prescaler division value, time
* segment 2 control, time segment 1 control, and resynchronization jump width control indicated by p_cfg.
* First some explanations. The CAN system clock, fcanclk, is the internal clock period of the CAN peripheral.
* This CAN system clock is determined by the CAN Baud Rate Prescaler value and the peripheral bus clock. One Time
* Quantum is equal to the period of the CAN clock.\n
* One CAN bus bit-time is an integer sum of a number of Time Quanta, Tq. Each bitrate register is then given a
* certain number of Tq of the total number of Time Quanta that make up one CAN bit period, or Tqtot.\n
* See section R_CAN_SetBitrate in the application note for details.
*/
void R_CAN_SetBitrate(const uint32_t ch_nr, const can_bitrate_config_t p_cfg)
{
    volatile struct st_can R_BSP_EVENACCESS_SFR * can_block_p;

    if (ch_nr < MAX_CHANNELS)
    {
        can_block_p = CAN_CHANNELS[ch_nr];
    }
    else
    {
        return;
    }

    /* Shift to CAN Reset mode only when the CAN operation mode is not Reset */
    if (CAN_RESET != can_block_p->CTLR.BIT.CANM)
    {
        /* Change to Reset mode */
        R_CAN_Control(ch_nr, RESET_CANMODE);
    }

    /* Set CAN clock select to be either PLL (default) or crystal direct. */
    can_block_p->BCR.BIT.CCLKS = 0; /* 0 = PLL. */

    /* Set TSEG1, TSEG2 and SJW. */
    can_block_p->BCR.BIT.BRP = p_cfg.BRP - 1;

    can_block_p->BCR.BIT.TSEG1 = p_cfg.TSEG1 - 1;

    can_block_p->BCR.BIT.TSEG2 = p_cfg.TSEG2 - 1;

    can_block_p->BCR.BIT.SJW = p_cfg.SJW - 1;
}
/******************************************************************************
 End of function R_CAN_SetBitrate
 *****************************************************************************/ /* end R_CAN_SetBitrate() */

/******************************************************************************
Function name:  can_module_stop_state_cancel
Description:    Release CAN peripherals from standby.
Arguments:      -
Return value:   -
******************************************************************************/
void can_module_stop_state_cancel(const uint32_t ch_nr)
{
    /* CAN: Module Stop Control Register B (MSTPCRB) bits 0-2 are for the CAN
    Peripherals.
    0: The module stop state is canceled.
    1: Transition to the module stop state is made. */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
    bsp_int_ctrl_t int_ctrl;
#endif
    /* First unlock the protect register. */
    /* Enable writing to PRCR bits while simultaneously enabling PRC1. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    if (0 == ch_nr)
    {
        MSTP(CAN0) = 0;
    }
#ifdef CAN1
    else if (1 == ch_nr)
    {
        MSTP(CAN1) = 0;
    }
#endif /* CAN1 */
#ifdef CAN2
    else if (2 == ch_nr)
    {
        MSTP(CAN2) = 0;
    }
#endif /* CAN2 */
    else
    {
        /* Do nothing */
        R_BSP_NOP();
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    /* Re-lock the protect register. */
    /* Enable writing to PRCR bits while simultaneously disabling PRC1. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}
/******************************************************************************
 End of function can_module_stop_state_cancel
 *****************************************************************************/
/* end CAN_ModuleStopState_cancel() */

/**********************************************************************************
Function name:  config_can_interrupts
Description:    Configuration of CAN interrupts.    
Arguments:      Channel nr.
Return value :  -
***********************************************************************************/
static void config_can_interrupts(const uint32_t ch_nr)
{
#if (USE_CAN_POLL == 0)
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
bsp_int_ctrl_t int_ctrl;
#endif

    if (0 == ch_nr)
    {
#if (CAN_USE_CAN0 == 1)
        /* Configure CAN Tx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN0, TXM0));  /* 1 = interrupt enabled. */
        IPR(CAN0, TXM0) = CAN0_INT_LVL; /* priority */

        /* Configure CAN FIFO Tx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN0, TXF0));  /* 1 = interrupt enabled. */
        IPR(CAN0, TXF0) = CAN0_INT_LVL; /* priority */

        /* Configure CAN Rx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN0, RXM0));
        IPR(CAN0, RXM0) = CAN0_INT_LVL;

        /* Configure CAN FIFO Rx interrupt. */
        R_BSP_InterruptRequestEnable(VECT(CAN0, RXF0));
        IPR(CAN0, RXF0) = CAN0_INT_LVL;

        /* Configure CAN Error interrupt. Must enable group that it belongs to */
        /* in addition to individual source. */
        R_BSP_InterruptRequestEnable(VECT(ICU, GROUPBE0));
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        EN(CAN0, ERS0) = 1; /* resolves to:  ICU.GEN[GEN_CAN0_ERS0].BIT.EN0 = 1; */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) 
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
        ICU.IPR[IPR_ICU_GROUPBE0].BIT.IPR = CAN0_INT_LVL;
        R_BSP_InterruptWrite(BSP_INT_SRC_BE0_CAN0_ERS0, (bsp_int_cb_t)can_err_callback[0]);

        /* Enable all CAN error interrupts. */
        CAN0.EIER.BYTE = 0xFF;

